Documents/ЗаявкаНаЗамер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаЗамер</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемыйСтатусЗамера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричинаИзменени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПредыдущая</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаИзменения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаявкаНаЗамер/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем НачальноеЗначениеПлановойДаты;

&НаКлиенте
Процедура ПомещенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	НеПоказыватьВВыборе = Новый Массив;
	
	Для каждого х Из Объект.Помещения Цикл
		НеПоказыватьВВыборе.Добавить(х.Помещение);	
	КонецЦикла;
	
	омПомещениеКлиент.ОткрытьПодборПомещения(Объект, ЭтаФорма, , , НеПоказыватьВВыборе, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПомещения(Результат, ДополнительныйПараметр) Экспорт	
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ДополнительныйПараметр = Неопределено Тогда
		
		Для каждого Помещение Из Результат Цикл
			
			НС = Объект.Помещения.Добавить();
			НС.Помещение = Помещение;
			
		КонецЦикла;
		
	Иначе 
		Если Результат.Количество() = 0 Тогда
		
			Возврат;	
		
		КонецЕсли;
		
		ДополнительныйПараметр.ТД.Помещение = Результат[0];
		
	КонецЕсли; 

КонецПроцедуры // ПослеВыбораЭлементовСделки()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеЗамеров");
КонецПроцедуры

#Область ПричинаИзмененияДаты
	
&НаКлиенте
Процедура ДатаВыездаПланПриИзменении(Элемент)
	
	Если НЕ НачальноеЗначениеПлановойДаты = Объект.ДатаВыездаПлан И НачальноеЗначениеПлановойДаты > Дата(1, 1, 1)  Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаПричиныИзмененияДаты", ЭтаФорма);
		ПоказатьВводСтроки(ОписаниеОповещения, "", "Причина изменения даты", 250, Истина);
	   	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаПричиныИзмененияДаты(ПричинаИзменения, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ПричинаИзменения) Тогда
	
		НС = Объект.ПричинаИзменени.Добавить();
		НС.Дата 			= ТекущаяДата();
		НС.ДатаПредыдущая	= НачальноеЗначениеПлановойДаты;
		НС.ПричинаИзменения = ПричинаИзменения;
		НС.Автор 			= омСотрудники.ПолучитьТекущегоПользователя();
		
		НачальноеЗначениеПлановойДаты = Объект.ДатаВыездаПлан;	
		
	Иначе
		
		Объект.ДатаВыездаПлан = НачальноеЗначениеПлановойДаты;
		ПоказатьПредупреждение(, "Не указана причина переноса даты.");
	
	КонецЕсли;

КонецПроцедуры // ПослеВводаПричиныИзмененияДаты(ПричинаИзменения, ДополнительныеПараметры)


&НаКлиенте
Процедура ПоказатьИсториюИзмененияДатыПлановой(Команда)
	ОткрытьФорму("ОбщаяФорма.ИсторияИзмененияДатыВыезда", Новый Структура("ДокументВыезда", Объект.Ссылка));
КонецПроцедуры


#КонецОбласти


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НачальноеЗначениеПлановойДаты = Объект.ДатаВыездаПлан;
	Элементы.ПоказатьИсториюИзмененияДатыПлановой.Видимость = Объект.ПричинаИзменени.Количество() > 0;
	
КонецПроцедуры
